tests/auto_build/testcases/output/AttMultiAttachmentRequest.out

POST /AttachmentService/services/AttachmentService HTTP/1.1
Host: localhost:13260
SOAPAction: ""
Content-Type: multipart/related; type="text/xml"; boundary="------=MIME_BOUNDARY"; start="<6>"
Content-Length: 1566


--------=MIME_BOUNDARY
Content-Type: text/xml; charset=UTF-8
Content-Transfer-Encoding: binary
Content-Id: <6>

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:multiAttachment xmlns:ns1="http://attachment.test.org">
<ns1:arg_0_0 href="cid:1"
   xsi:type="ns2:DataHandler"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
<ns1:arg_1_0 href="cid:2"
   xsi:type="ns2:DataHandler"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
<ns1:arg_2_0 href="cid:5"
   xsi:type="ns2:Image"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
<ns1:arg_3_0 href="cid:4"
   xsi:type="ns2:DataHandler"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
</ns1:multiAttachment>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>


--------=MIME_BOUNDARY
Content-Id: <1>
Content-Type: text/plain
Content-Transfer-Encoding: base64

VGhpcyBpcyBhIHRlc3QgbWVzc2FnZSBmb3IgYXR0YWNobWVudA==

--------=MIME_BOUNDARY
Content-Id: <2>
Content-Type: text/plain
Content-Transfer-Encoding: base64

VGhpcyBpcyBhIHRlc3QgbWVzc2FnZSBmb3IgYXR0YWNobWVudA==

--------=MIME_BOUNDARY
Content-Id: <4>
Content-Type: text/plain
Content-Transfer-Encoding: base64

VGhpcyBpcyBhIHRlc3QgbWVzc2FnZSBmb3IgYXR0YWNobWVudA==

--------=MIME_BOUNDARY
Content-Id: <5>
Content-Type: image/jpeg
Content-Transfer-Encoding: base64

VGhpcyBpcyBhIHRlc3QgbWVzc2FnZSBmb3IgYXR0YWNobWVudA==

--------=MIME_BOUNDARY--
